<a href="https://colab.research.google.com/github/moyanke/inf1340-programmingfordatascience-fa22/blob/main/MID__Sub_YankeMo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly
df = pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx')

In [3]:
table_01 = pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 1')
table_02= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 2')
table_03= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 3')
table_04= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 4')
table_05= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 5')
table_06= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 6')
table_annex= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='ANNEX')
table_notes= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='NOTES')

In [ ]:
table_01

In [ ]:
table_1_1 = table_01.drop(table_01.index[0:15])
table_1_1 #Drop 0-15 rows

In [ ]:
table_1_1.columns

In [5]:
table_1_1.columns=['Order','Name of Area','Notes','Country Code','Type of Data(a)','1990 Migrant Stock Both Sex',
                  '1995 Migrant Stock Both Sex','2000 Migrant Stock Both Sex','2005 Migrant Stock Both Sex',
                  '2010 Migrant Stock Both Sex','2015 Migrant Stock Both Sex','1990 Migrant Stock Male',
                  '1995 Migrant Stock Male','2000 Migrant Stock Male','2005 Migrant Stock Male','2010 Migrant Stock Male',
                  '2015 Migrant Stock Male','1990 Migrant Stock Female','1995 Migrant Stock Female','2000 Migrant Stock Female',
                  '2005 Migrant Stock Female','2010 Migrant Stock Female',
                  '2015 Migrant Stock Female']

In [ ]:
table_1_1 #rename the columns

In [6]:
tidy_table_01 = table_1_1.melt(id_vars=["Order","Name of Area","Notes","Country Code","Type of Data(a)"],var_name="Year",value_name="Migrant Stock")

In [ ]:
tidy_table_01

In [7]:
tidy_table_01=(tidy_table_01.assign(year = lambda x: x.Year.str[:4].astype(str), Gender = lambda x: x.Year.str[18:].astype(str)).drop("Year",axis=1))
tidy_table_01.sort_values(by ='Order').reset_index().drop(columns = 'index') #Separate the Year cloumns into year, gemder, migrant stock

,Order,Name of Area,Notes,Country Code,Type of Data(a),Migrant Stock,year,Gender
0,1,WORLD,NaN,900,NaN,152563212,1990,Both Sex
1,1,WORLD,NaN,900,NaN,93402426,2005,Female
2,1,WORLD,NaN,900,NaN,84818470,2000,Female
3,1,WORLD,NaN,900,NaN,172703309,2000,Both Sex
4,1,WORLD,NaN,900,NaN,79064275,1995,Female
...,...,...,...,...,...,...,...,...
4765,265,Wallis and Futuna Islands,NaN,876,B,676,1990,Female
4766,265,Wallis and Futuna Islands,NaN,876,B,821,1995,Female
4767,265,Wallis and Futuna Islands,NaN,876,B,997,2000,Female
4768,265,Wallis and Futuna Islands,NaN,876,B,859,1995,Male
4769,265,Wallis and Futuna Islands,NaN,876,B,1411.0,2015,Female

##########Table_02##########

In [ ]:
table_02

In [ ]:
table_2_1 = table_02.drop(table_02.index[0:15])
table_2_1 #Drop 0-15 rows

In [9]:
table_2_1.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21'],
      dtype='object')

In [10]:
table_2_1.columns=['Order','Name of Area','Notes','Country Code','1990 Total Population Both Sex',
                  '1995 Total Population Both Sex','2000 Total Population Both Sex','2005 Total Population Both Sex',
                  '2010 Total Population Both Sex','2015 Total Population Both Sex','1990 Total Population Male',
                  '1995 Total Population Male','2000 Total Population Male','2005 Total Populatio Male','2010 Total Population Male',
                  '2015 Total Population Male','1990 Total Population Female','1995 Total Population Female','2000 Total Population Female',
                  '2005 Total Population Female','2010 Total Population Female',
                  '2015 Total Population Female']

In [ ]:
table_2_1

In [11]:
tidy_table_02 = table_2_1.melt(id_vars=["Order","Name of Area","Notes","Country Code"],var_name="Year",value_name="Total Population")

In [ ]:
tidy_table_02

In [ ]:
tidy_table_02=(tidy_table_02.assign(year = lambda x: x.Year.str[:4].astype(str), Gender = lambda x: x.Year.str[22:].astype(str)).drop("Year",axis=1))
tidy_table_02.sort_values(by ='Order').reset_index().drop(columns = 'index') #Separate the Year cloumns into year, gemder, migrant stock #Separate the Year cloumns into year, gemder, total population

maybe we can split 1990, 1995, 2000...into different column,based on the 
notebooks in the Guthub, can we used NaN in it.

In [ ]:
#write up of what violation you find, five page at least with picture. 
#use table_01.set_index("Name of area", inpplace = True)把name of area 变成中心指标

##########Table_03##########

In [ ]:
table_03

In [ ]:
table_3_1 = table_03.drop(table_03.index[0:15])
table_3_1 #Drop 0-15 rows

In [14]:
table_3_1.columns=['Order','Name of Area','Notes','Country Code','Type of Data(a)','1990 Migrant Stock Percentage for Both Sex',
                  '1995 Migrant Stock Percentage for Both Sex','2000 Migrant Stock Percentage for Both Sex','2005 Migrant Stock Percentage for Both Sex',
                  '2010 Migrant Stock Percentage for Both Sex','2015 Migrant Stock Percentage for Both Sex','1990 Migrant Stock Percentage for Male',
                  '1995 Migrant Stock Percentage for Male','2000 Migrant Stock Percentage for Male','2005 Migrant Stock Percentage for Male','2010 Migrant Stock Percentage for Male',
                  '2015 Migrant Stock Percentage for Male','1990 Migrant Stock Percentage for Female','1995 Migrant Stock Percentage for Female','2000 Migrant Stock Percentage for Female',
                  '2005 Migrant Stock Percentage for Female','2010 Migrant Stock Percentage for Female',
                  '2015 Migrant Stock Percentage for Female']

In [ ]:
table_3_1

In [15]:
tidy_table_03 = table_3_1.melt(id_vars=["Order","Name of Area","Notes","Country Code","Type of Data(a)"],var_name="Years",value_name="International Migrant Stock as Percentage of Total Population")

In [ ]:
tidy_table_03

In [ ]:
tidy_table_03=(tidy_table_03.assign(year = lambda x: x.Years.str[:4].astype(str), Gender = lambda x: x.Years.str[33:].astype(str)).drop("Years",axis=1))
tidy_table_03.sort_values(by ='Order').reset_index().drop(columns = 'index') #Separate the Year cloumns into year, gemder, migrant stock

########Table_4##########

In [ ]:
table_04

In [ ]:
table_4_1 = table_04.drop(table_04.index[0:15])
table_4_1 #Drop 0-15 rows

In [18]:
table_4_1.columns=['Order','Name of Area','Notes','Country Code','Type of Data(a)',
                   '1990 Female Migrants Stock Percentage Performance',
                   '1995 Female Migrants Stock Percentage Performance',
                   '2000 Female Migrants Stock Percentage Performance',
                   '2005 Female Migrants Stock Percentage Performance',
                   '2010 Female Migrants Stock Percentage Performance',
                   '2015 Female Migrants Stock Percentage Performance']

In [19]:
tidy_table_04 = table_4_1.melt(id_vars=["Order","Name of Area","Notes","Country Code","Type of Data(a)"],var_name="Years",value_name="Female Migrants Stock Percentage Performance")

In [ ]:
tidy_table_04

In [ ]:
tidy_table_04=(tidy_table_04.assign(Year = lambda x: x.Years.str[:4].astype(str), Gender = lambda x: x.Years.str[5:11].astype(str)).drop("Years",axis=1))
tidy_table_04.sort_values(by ='Order').reset_index().drop(columns = 'index') #Separate the Year cloumns into year, gemder, migrant stock

###########Table_5############

In [ ]:
table_05

In [ ]:
table_5_1 = table_05.drop(table_05.index[0:15])
table_5_1 #Drop 0-15 rows

In [22]:
table_5_1.columns=['Order','Name of Area','Notes','Country Code','Type of Data(a)','1990-1995 Annual rate of change Both Sex',
                  '1995-2000 Annual rate of change Both Sex','2000-2005 Annual rate of change Both Sex',
                  '2005-2010 Annual rate of change Both Sex','2010-2015 Annual rate of change Both Sex',
                  '1990-1995 Annual rate of change Male','1995-2000 Annual rate of change Male',
                  '2000-2005 Annual rate of change Male','2005-2010 Annual rate of change Male',
                  '2010-2015 Annual rate of change Male','1990-1995 Annual rate of change Female',
                  '1995-2000 Annual rate of change Female','2000-2005 Annual rate of change Female',
                  '2005-2010 Annual rate of change Female','2010-2015 Annual rate of change Female']

In [23]:
tidy_table_05 = table_5_1.melt(id_vars=["Order","Name of Area","Notes","Country Code","Type of Data(a)"],var_name="Years",value_name="Annual Rate of Change of Migrant Stock")

In [ ]:
tidy_table_05

In [ ]:
tidy_table_05=(tidy_table_05.assign(Year_Range = lambda x: x.Years.str[:8].astype(str), Gender = lambda x: x.Years.str[30:].astype(str)).drop("Years",axis=1))
tidy_table_05.sort_values(by ='Order').reset_index().drop(columns = 'index') #Separate the Year cloumns into year, gemder, migrant stock

#########Table_06#########

In [ ]:
table_06

In [ ]:
table_6_1 = table_06.drop(table_06.index[0:15])
table_6_1 #Drop 0-15 rows

In [26]:
table_6_1.columns=['Order','Name of Area','Notes','Country Code','Type of Data(a)','1990 Estimated refugee stock at mid-year both sexes',
                  '1995 Estimated refugee stock at mid-year both sexes','2000 1995 Estimated refugee stock at mid-year both sexes',
                  '2005 1995 Estimated refugee stock at mid-year both sexes',
                  '2010 1995 Estimated refugee stock at mid-year both sexes','2015 1995 Estimated refugee stock at mid-year both sexes',
                  '1990 Refugees as a percentage of the international migrant stock',
                  '1995 Refugees as a percentage of the international migrant stock',
                  '2000 Refugees as a percentage of the international migrant stock',
                  '2005 Refugees as a percentage of the international migrant stock',
                  '2010 Refugees as a percentage of the international migrant stock',
                  '2015 Refugees as a percentage of the international migrant stock',
                  '1990-1995 Annual rate of change of the refugee stock',
                  '1995-2000 Annual rate of change of the refugee stocke',
                  '2000-2005 Annual rate of change of the refugee stock',
                  '2005-2010 Annual rate of change of the refugee stock',
                  '2010-2015 Annual rate of change of the refugee stock']

In [ ]:
table_6_1

In [ ]:
tidy_table_06 = table_6_1.melt(id_vars=["Order","Name of Area","Notes","Country Code","Type of Data(a)"],var_name="Years",value_name="Refugee Stocks")
tidy_table_06

In [ ]:
tidy_table_06[['Year', 'Annual Rate of Change']] = tidy_table_06['Years'].str.split(' ', 1, expand=True)
tidy_table_06

,Order,Name of Area,Notes,Country Code,Type of Data(a),Years,Refugee Stocks,Year,Annual Rate of Change
0,1,WORLD,NaN,900,NaN,1990 Estimated refugee stock at mid-year both ...,18836571,1990,Estimated refugee stock at mid-year both sexes
1,2,Developed regions,(b),901,NaN,1990 Estimated refugee stock at mid-year both ...,2014564,1990,Estimated refugee stock at mid-year both sexes
2,3,Developing regions,(c),902,NaN,1990 Estimated refugee stock at mid-year both ...,16822007,1990,Estimated refugee stock at mid-year both sexes
3,4,Least developed countries,(d),941,NaN,1990 Estimated refugee stock at mid-year both ...,5048391,1990,Estimated refugee stock at mid-year both sexes
4,5,Less developed regions excluding least develop...,NaN,934,NaN,1990 Estimated refugee stock at mid-year both ...,11773616,1990,Estimated refugee stock at mid-year both sexes
...,...,...,...,...,...,...,...,...,...
4500,261,Samoa,NaN,882,B,2010-2015 Annual rate of change of the refugee...,..,2010-2015,Annual rate of change of the refugee stock
4501,262,Tokelau,NaN,772,B,2010-2015 Annual rate of change of the refugee...,..,2010-2015,Annual rate of change of the refugee stock
4502,263,Tonga,NaN,776,B,2010-2015 Annual rate of change of the refugee...,..,2010-2015,Annual rate of change of the refugee stock
4503,264,Tuvalu,NaN,798,C,2010-2015 Annual rate of change of the refugee...,..,2010-2015,Annual rate of change of the refugee stock
4504,265,Wallis and Futuna Islands,NaN,876,B,2010-2015 Annual rate of change of the refugee...,..,2010-2015,Annual rate of change of the refugee stock

In [ ]:
tidy_table_06[[' of Refugee Stock', 'Gender']] = tidy_table_06['Annual Rate of Change'].str.split(' ', 5, expand=True)
tidy_table_06

NameError: ignored